app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "femboy"], ["description", "he a lil gay teehee"], ["price", 19.69], ["user_id", 1], ["created_at", "2021-03-01 22:56:46.143959"], ["updated_at", "2021-03-01 22:56:46.143959"]]
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user

    respond_to do |format|
      if @product.save